Tekla.Structures.TeklaStructuresInternal.AsyncCallCompletion`1.FromProxy(System.Action{Tekla.Structures.Internal.IAsyncCallCompletion{`0}})
Provides wrapped asyncronous facade for proxied call.
beginProxy: Proxied begin call.
Returns: Awaitable task which returns the result.

Tekla.Structures.TeklaStructuresInternal.AsyncCallCompletion`1.FromProxy``1(``0,System.Action{``0,Tekla.Structures.Internal.IAsyncCallCompletion{`0}})
Provides wrapped asyncronous facade for proxied call.
The argument type.
arg0: The argument.
beginProxy: Proxied begin call.
Returns: Awaitable task which returns the result.